tutorials/multiCore_interpolatePhi/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

L_x_min         -75;
L_x_max         75;
L_y_min         -50;
L_y_max         50;

L_z             0.5;
L_z_neg         #eval "-$L_z";

n_x             1000;
n_y             1000;
n_z             1;

vertices
(
    ( $L_x_min     $L_y_min   $L_z_neg)
    ( $L_x_max     $L_y_min   $L_z_neg)
    ( $L_x_max     $L_y_max   $L_z_neg)
    ( $L_x_min     $L_y_max   $L_z_neg)
    ( $L_x_min     $L_y_min   $L_z)
    ( $L_x_max     $L_y_min   $L_z)
    ( $L_x_max     $L_y_max   $L_z)
    ( $L_x_min     $L_y_max   $L_z)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($n_x $n_y $n_z)
    simpleGrading
    (
        (
            (0.5    0.25    2e-4)
            (#eval{1/($L_x_max-$L_x_min)}   0.55     5)
            (#eval{0.5-1/($L_x_max-$L_x_min)}  0.2    500)
        )
        (
            (#eval{0.5-1/(10*($L_y_max-$L_y_min))} 0.3 1e-3)
            (#eval{1/(10*($L_y_max-$L_y_min))}   0.2 2e-1)
            (#eval{1/(10*($L_y_max-$L_y_min))}   0.2 5)
            (#eval{0.5-1/(10*($L_y_max-$L_y_min))} 0.3 1000)
        )
        1
    ) 
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    top
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    bottom
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
